process where event.code == "10" and 
  winlog.event_data.TargetImage : "*\\lsass.exe" and
  winlog.event_data.GrantedAccess in ("0x1F0FFF", "0x1010", "0x1410") and
  not winlog.event_data.SourceImage : ("*\\msmpeng.exe", "*\\svchost.exe")