title: SAM Hive Backup via Reg.exe Execution
id: f421118d-bbcc-4081-bb38-cd52d5851aa9
status: stable
description: Detects command-line export or saving of the SAM, SYSTEM, or SECURITY registry hives to local files for offline credential cracking.
author: Detection Engineer Specialist
date: 2026/06/28
tags:
    - attack.credential_access
    - attack.t1003.002
logsource:
    product: windows
    category: process_creation
detection:
    selection:
        Image|endswith: '\reg.exe'
        CommandLine|contains:
            - ' save '
            - ' export '
    sub_selection:
        CommandLine|contains:
            - 'sam'
            - 'system'
            - 'security'
    condition: selection and sub_selection
falsepositives:
    - Emergency system recovery automated backup configurations generated by administrators.
level: high